Repository: e-ChatProject/echat-wallet
Catalog: *.lproj/WalletLocalizable.strings
Languages: ar, hi, id, ko, ru, th, vi, zh_hans

# Wallets
source: ECHT
zh_hans: 钱包

# WalletLabelTitle
source: Transactions
ar: المعاملات
hi: लेन-देन
id: Transksi
ko: 업무
ru: Транзакции
th: การทำธุรกรรม
vi: Giao dịch
zh_hans: 交易

# WalletBalanceEmptyTitle
source: You don't have a transactions
ar: ليس لديك معاملات
hi: आपके पास लेनदेन नहीं हैं
id: Anda belum memiliki transaksi
ko: 당신은 거래가 없습니다
ru: У вас нет транзакций
th: คุณไม่มีการทำธุรกรรม
vi: Bạn không có giao dịch
zh_hans: 您没有任何交易

# TFilterAll
source: All
ar: كافة
hi: सब
id: Semua
ko: 모든
ru: Все
th: ทั้งหมด
vi: Tất cả
zh_hans: 所有

# TFilterSent
source: Sent
ar: ارسال
hi: भेज दिया
id: Terkirim
ko: 전송 됨
ru: Отправлено
th: ส่ง
vi: Gởi
zh_hans: 发送

# TFilterReceived
source: Received
ar: تم الاستلام
hi: प्राप्त किया
id: Diterima
ko: 받은
ru: Получено
th: ที่ได้รับ
vi: Nhận
zh_hans: 收到

# TFilterCryptolike
source: ECHTlike
ar: كريبتولايك
hi: ECHTलाइक
ru: ECHTлайк
th: ECHTชอบ
zh_hans: ECHT赞

# TFilterWithdraw
source: Withdraw
ar: عمليات الإنسحاب
hi: निकालना
id: Menarik
ko: 빼다
ru: Вывод
th: ถอน
vi: Rút tiền
zh_hans: 收回

# WalletSent
source: Sent
ar: تم الإرسال
hi: भेज दिया
id: Terkirim
ko: 전송 됨
ru: Отправлено
th: ส่ง
vi: Gởi
zh_hans: 发送

# WalletReceived
source: Received
ar: تم الاستلام
hi: प्राप्त किया
id: Diterima
ko: 받은
ru: Получено
th: ที่ได้รับ
vi: Nhận
zh_hans: 收到

# WalletCryptolike
source: ECHTlike
ar: كريبتولايك
hi: ECHTलाइक
ru: ECHTлайк
th: ECHTชอบ
zh_hans: ECHT赞

# WalletWithdraw
source: Withdraw
ar: عمليات الانسحاب
hi: निकालना
id: Menarik
ko: 빼다
ru: Вывод
th: ถอน
vi: Rút tiền
zh_hans: 收回

# WalletReceiveTitle
source: Receive
ar: استلام
hi: प्राप्त करें
id: Terima
ko: 받다
ru: Получить
th: ได้รับ
vi: Nhận
zh_hans: 接收

# WalletSendTitle
source: Send
ar: الأيصال
hi: भेजें
id: Kirim
ko: 보내다
ru: Отправить
th: ส่ง
vi: Gửi
zh_hans: 发送

# WalletContactTo
source: to
ar: إلى
hi: किस को
id: ke
ko: 에
ru: для
th: ถึง
vi: đến
zh_hans: 至

# WalletContactFrom
source: from
ar: من
hi: किस से
id: Dari
ko: 에서
ru: от
th: จาก
vi: từ
zh_hans: 从

# WalletToday
source: Today
ar: اليوم
hi: आज
id: Hari ini
ko: 오늘
ru: Сегодня
th: วันนี้
vi: Hôm nay
zh_hans: 今天

# WalletYesterday
source: Yesterday
ar: أمس
hi: बिता कल
id: Kemarin
ko: 어제
ru: Вчера
th: เมื่อวานนี้
vi: Hôm qua
zh_hans: 昨天

# WalletTomorrow
source: Tomorrow
ar: غداً
hi: कल
id: Besok
ko: 내일
ru: Завтра
th: พรุ่งนี้
vi: Ngày mai
zh_hans: 明天

# WalletNext
source: Next
ar: التالي
hi: अगला
id: Selanjutnya
ru: Далее
th: ถัดไป
vi: Kế tiếp
zh_hans: 继续

# WalletSendMoney
source: Send to
ar: إرسال إلى
hi: ..को भेजें
id: Kirim ke
ko: 보내기
ru: Отправить
th: ส่งถึง
vi: Gửi đến
zh_hans: 发送

# WalletNewAccount
source: New account
ar: حساب جديد
hi: नया खाता
id: Akun baru
ko: 새 계정
ru: Новый аккаунт
th: บัญชีใหม่
vi: Tài khoản mới
zh_hans: 新账号

# WalletFindContact
source: Find a contact
ar: العثور على جهة الاتصال
hi: संपर्क खोजें
id: Temukan kontak
ko: 연락처 찾기
ru: Найти контакт
th: ค้นหาที่ิอยู่ที่ติดต่อ
vi: Tìm một liên hệ
zh_hans: 寻找联系人

# WalletTo
source: To
ar: إلى
id: Ke
ko: 에
ru: Кому
th: ถึง
vi: Đến
zh_hans: 至

# WalletSetPinMessage
source: Please set a pin code
ar: يرجى ضبط الرمز السري
id: Harap tentukan kode pin
ko: 핀 코드를 설정하십시오
ru: Пожалуйста установите пин код
th: กรุณาตั้งรหัส PIN
vi: Vui lòng đặt mã PIN
zh_hans: 请设置PIN码

# WalletEmptyContactMessage
source: Please select the contact for send amount
ar: يرجى اختيار مستخدم لأرسال المبلغ
hi: कृपया राशि भेजने के लिए संपर्क का चयन करें
id: Harap pilih kontak untuk mengirim jumlah
ko: 송금 할 연락처를 선택하십시오.
ru: Выберите получателя
th: กรุณาเลือกที่อยู่ที่ติดต่อสำหรับการส่งจำนวนนวนเงิน
vi: Vui lòng chọn số liên lạc để gửi tiền
zh_hans: 选择要发送的联系人

# WalletEmptyMoneyMessage
source: Please enter the amount
ar: يرجى إدخال مبلغ
hi: कृपया राशि दर्ज करें
id: Harap masukkan jumlah
ko: 금액을 입력하십시오
ru: Введите сумму
th: กรุณาใส่จำนวนเงิน
vi: Vui lòng nhập số tiền
zh_hans: 请输入金额

# WalletMinSendMoneyMessage
source: Please enter amount more then 0
ar: يرجى ادخال مبلغ أكثر من ٠
hi: 0 से अधिक राशि दर्ज करें
id: Harap masukkan jumlah lebih dari 0
ko: 금액을 0보다 많이 입력하십시오.
ru: Введите сумму больше 0
th: กรุณาใส่จำนวนเงินที่มากกว่า 0
vi: Số tiền phải lớn hơn 0
zh_hans: В请输入大于0的金额

# WalletMaxMoneyMessage
source: Please enter amount less then your balance
ar: يرجى ادخال مبلغ أقل من مبلغ رصيدك
hi: कृपया अपने बैलेंस से कम राशि दर्ज करें
id: Harap masukkan jumlah lebih kecil dari saldo Anda
ko: 금액보다 적은 금액을 입력하십시오.
ru: Недостаточно средств
th: กรุณาใส่จำนวนเงินที่น้อยกว่ายอดเงินของคุณ
vi: Vui lòng nhập số tiền nhỏ hơn số dư của bạn
zh_hans: 请输入少于余额的金额

# WalletLimitMoneyMessage
source: Please enter amount less then 99999
ar: يرجى إدخال مبلغ أقل من ٩٩٩٩٩
hi: 99 999 से कम राशि दर्ज करें
id: Harap masukkan jumlah lebih kecil dari 99999
ko: 99999보다 적은 금액을 입력하십시오.
ru: Введите сумму менее 99999
th: กรุณาใส่จำนวนเงินน้อยกว่า 99999
vi: Vui lòng nhập số tiền nhỏ hơn 99999
zh_hans: 请输入小于99999的金额

# WalletScanWrongQrMessage
source: Wrong ECHT address
ar: عنوان ECHT خاطئ
hi: गलत ECHT पता
id: Alamat ECHT salah
ko: 잘못된 ECHT 주소
ru: Неверный адрес ECHT
th: ที่อยู่ ECHT ผิด
vi: Sai địa chỉ ví ECHT
zh_hans: ECHT地址不正确

# WalletEnterWrongQrMessage
source: Please enter a right QR wallet
ar: يرجى ادخال باركود المحفظة بشكل صحيح
hi: कृपया एक सही QR वॉलेट दर्ज करें
id: Harap masukkan dompet QR yang benar
ko: 올바른 QR 지갑을 입력하십시오.
ru: Введите правильный адрес кошелька
th: กรุณาใส่ QR wallet ที่ถูกต้อง
vi: Vui lòng nhập đúng ví QR
zh_hans: 请输入正确的二维码钱包

# WalletWrongPinMessage
source: Please enter a right pin
ar: يرجى ادخال رمز سري صحيح
hi: कृपया एक सही पिन दर्ज करें
id: Harap masukkan pin yang benar
ko: 올바른 핀을 입력하십시오
ru: Введите правильный пин код
th: กรุณาใส่ PIN ที่ถูกต้อง
vi: Vui lòng nhập đúng mã PIN
zh_hans: 请输入正确的PIN

# WalletScanQR
source: Scan QR address
ar: قراءة عنوان الباركود
hi: QR पता स्कैन करें
id: Scan alamat QR
ko: QR 주소 스캔
ru: Скан QR адреса
th: สแกนที่อยู๋ QR
vi: Quét mã QR
zh_hans: 扫描二维码地址

# WalletReceipt
source: Your Receipt
ar: الإيصال
hi: आपकी रसीद
id: Tanda terima Anda
ko: 귀하의 영수증
ru: Ваш Чек
th: ใบเสร็จของคุณ
vi: Biên lai của bạn
zh_hans: 您的收据

# WalletConfirmInfo
source: Please confirm the information
ar: يرجى تأكيد المعلومات
hi: कृपया जानकारी की पुष्टि करें
id: Harap konfirmasi informasi ini
ko: 정보를 확인하십시오
ru: Пожалуйста, подтвердите информацию
th: กรุณายืนยันข้อมูล
vi: Vui lòng xác nhận giao dịch
zh_hans: 请核对信息是否正确

# WalletAccount
source: e-Chat ACCOUNT
ar: حساب e-Chat
hi: e-Chat खाता
id: AKUN e-Chat
ko: e- 채팅 계정
ru: e-Chat АККАУНТ
th: บัญชี e-Chat
vi: TÀI KHOẢN e-Chat
zh_hans: e-Chat账号

# WalletDate
source: Date
ar: التاريخ
hi: तारीख
id: Tanggal
ko: 날짜
ru: Дата
th: วัน
vi: Ngày
zh_hans: 日期

# WalletTime
source: Time
ar: الوقت
hi: समय
id: Waktu
ko: 시각
ru: Время
th: เวลา
vi: Giờ
zh_hans: 时间

# WalletTotal
source: Amount to send
ar: المبلغ المراد إرساله
hi: भेजी जाने वाली राशि
id: Jumlah yang ingin dikirim
ko: 보낼 금액
ru: Сумма отправки
th: จำนวนเงินที่ส่ง
vi: Số tiền gửi
zh_hans: 发送金额

# WalletReform
source: Reform
ar: تعديل
hi: बदलें
id: Formasi ulang
ko: 개정
ru: Изменить
th: ปฏิรูป
vi: Sửa đổi
zh_hans: 进行更改

# WalletConfirm
source: Confirm
ar: تأكيد
hi: पुष्टि करें
id: Konfirmasi
ko: 확인
ru: Подтвердить
th: ยืนยัน
vi: Xác nhận
zh_hans: 确认

# WalletUserHolder
source: User name
ar: اسم المستخدم
hi: उपयोगकर्ता का नाम
id: Nama pengguna
ko: 사용자 이름
ru: Имя пользователя
th: ชื่อผู้ใช้
vi: Tên người dùng
zh_hans: 用户名

# WalletAmountHolder
source: Enter amount
ar: أدخل المبلغ
hi: राशि दर्ज करें
id: Masukkan jumlah
ko: 금액을 입력하세요
ru: Введите сумму
th: ป้อนจำนวนเงิน
vi: Nhập số tiền
zh_hans: 输入金额

# WalletIncognito
source: Incognito
ar: متخفي
hi: गुप्त रूप से
ko: 가명
th: ไม่เผยตัว
vi: Riêng tư
zh_hans: 匿名

# WalletWithdrawSubtitle
source: Enter the amount for withdraw
ar: أدخل مبلغ المراد سحبه
hi: निकालने के लिए राशि दर्ज करें
id: Masukkan jumlah yang ingin ditarik
ko: 철수 금액 입력
ru: Введите сумму для отправки
th: ใส่จำนวนเงินในการถอนเงิน
vi: Nhập số tiền cần rút
zh_hans: 扣除提现金额

# WalletAmount
source: Enter amount
ar: أدخل المبلغ
hi: राशि दर्ज करें
id: Masukkan jumlah
ko: 금액을 입력하세요
ru: Введите сумму
th: ใส่จำนวนเงิน
vi: Nhập số tiền
zh_hans: 输入金额

# WalletReceiver
source: Receiver address
ar: عنوان المستلم
hi: प्राप्तकर्ता का पता
id: Alamat penerima
ko: 수신자 주소
ru: Адрес получателя
th: ที่อยู่ผู้รับ
vi: Địa chỉ người nhận
zh_hans: 获取地址

# WalletMinMoneyMessage
source: Please enter amount more then 20
ar: يرجى ادخال مبلغ أكثر من ٢٠
hi: कृपया 20 से अधिक राशि दर्ज करें
id: Harap masukkan jumlah lebih dari 20
ko: 금액을 20 이상 입력하십시오.
ru: Введите сумму больше 20
th: กรุณาใส่จำนวนเงินมากกว่า 20
vi: Vui lòng nhập số tiền lớn hơn 20
zh_hans: 输入超过20的金额

# WalletEmptyAddressMessage
source: Please enter the address for amount send
ar: يرجى ادخال العنوان لإرسال الأموال
hi: राशि भेजने के लिए पता दर्ज करें
id: Silakan masukkan alamat untuk jumlah kirim
ko: 송,금 할 주소를 입력하십시오.
ru: Введите адрес для отправки денег
th: กรุณาใส่ที่อยู่สำหรับส่งจำนวนเงิน
vi: Vui lòng nhập địa chỉ để rút tiền
zh_hans: 输入金额发送地址

# WalletWrongAddressMessage
source: Please enter valid receiver address
ar: يرجى ادخال عنوان المستلم بشكل صحيح
hi: कृपया प्राप्तकर्ता का वैध पता दर्ज करें
id: Silakan masukkan alamat penerima yang valid
ko: 유효한 수신자 주소를 입력하십시오
ru: Введите правильный адрес получателя для отправки денег
th: กรุณาป้อนที่อยู่ผู้รับให้ถูกต้อง
vi: Vui lòng nhập đúng địa chỉ người nhận
zh_hans: 输入有效的收款人地址

# WalletConfirmWithdraw
source: Confirm Withdraw
ar: تأكيد السحب
hi: निकासी की पुष्टि करें
id: Konfirmasi penarikan
ru: Подтвердить отправку
th: ยืนยันการถอนงเงิน
vi: Xác nhận rút tiền
zh_hans: 确认资金提现

# WalletConfirmMessage
source: Do you really want to send
ar: هل حقاً ترغب بإرسال
hi: क्या आप वास्तव में भेजना चाहते हैं
id: Apakah Anda benar-benar ingin mengirim
ko: 정말-로 보내시겠습니까?
ru: Вы действительно хотите отправить
th: คุณต้องการส่ง
vi: Bạn thực sự muốn gửi tiền
zh_hans: 您确定想要发送

# WalletToAddress
source: to address
ar: إلى العنوان
hi: इस पते को
id: Ke alamat
ko: 주소
ru: на адрес
th: ถึงที่อยู่
vi: đến địa chỉ
zh_hans: 至钱包

# WalletCopied
source: Copied
ar: تم النسخ
hi: कॉपी की गयी
id: Disalin
ko: 복사 됨
ru: Скопировано
th: คัดลอก
vi: Đã sao chép
zh_hans: 已复制

# WalletCopyHashButton
source: Copy
ar: نسخ
hi: कॉपी करें
id: Salin
ko: 부
ru: Копировать
th: สำเนา
vi: Sao chép
zh_hans: 复制

# 未设置交易密码
source: No transaction password set
ar: لم يتم ضبط كلمة المرور للمعاملات
hi: कोई लेनदेन पासवर्ड नहीं सेट किया गया है
id: Tidak ada password transaksi
ko: 거래 비밀번호 없음
ru: Нет пароля для транзакции
th: ยังไม่มีการตั้งรหัสการทำธุรกรรม
vi: Không có mật khẩu giao dịch nào được đặt
zh_hans: 未设置交易密码

# WalletTransactionSuccess
source: Transaction completed success
ar: تم أكمال المعاملة بنجاح
hi: लेनदेन सफलतापूर्वक पूरा किया गया
id: Transaksi berhasil diselesaikan
ko: 거래 완료 성공
ru: Транзакция успешно завершена
th: การทำธุรกรรมเสร็จสมบูรณ์
vi: Giao dịch thành công
zh_hans: 交易已成功完成

# WalletTransactionFailed
source: Transaction not completed
ar: المعاملة لم تكتمل
hi: लेनदेन पूरा नहीं किया गया
id: Transaksi belum selesai
ko: 거래가 완료되지 않았습니다
ru: Транзация не завершена
th: การทำธุรกรรมไม่สมบูรณ์
vi: Giao dịch không thành công
zh_hans: 交易未执行

# WalletAddressLoadError
source: Could not load user address now Please check your internet connection and try a later.
ar: خطأ تحميل بيانات المستخدم، يرجى التحقق من الاتصال بالانترنت ومحاولة مرة أخرى.
hi: अब उपयोगकर्ता का पता नहीं लोड किया जा सकता है। कृपया अपना इंटरनेट कनेक्शन जांचें और बाद में प्रयास करें।
id: Tidak dapat memuat alamat pengguna sekarang nHarap periksa koneksi internet Anda dan coba lagi.
ko: 사용자 주소를로드 할 수 없습니다. 인터넷 연결을 확인하고 나중에 시도하십시오.
ru: Не удалось загрузить Ваш адрес пользователя. Пожалуйста, проверьте подключение к Интернету и попробуйте позже.
th: ไม่สามารถโหลดที่อยู่ผู้ใช้ได้ตอนนี้, กรุณาตรวจสอบการเชื่อมต่อเข้าอินเทอร์เน็ทและลองใหม่.
vi: Không thể tải địa chỉ của người dùng Vui lòng kiểm tra kết nối mạng rồi thử lại.
zh_hans: 现在无法加载用户地址 请检查您的网络连接并稍后再试。

# WalletTransactionsLoadError
source: Could not load your transactions list now Please check your internet connection and try a later.
ar: خطأ تحميل قائمة المعاملات الخاصة بك، يرجى التحقق من الاتصال بالانترنت ومحاولة مرة أخرى
hi: अब आपके लेनदेनों की सूची नहीं लोड की जा सकती है। कृपया अपना इंटरनेट कनेक्शन जांचें और बाद में प्रयास करें।
id: Tidak dapat memuat daftar transaksi Anda sekarang nHarap periksa koneksi internet Anda dan coba lagi.
ko: 지금 거래 목록을로드 할 수 없습니다. 인터넷 연결을 확인하고 나중에 시도하십시오.
ru: Не удалось загрузить Ваш список транзакций. Пожалуйста, проверьте подключение к Интернету и попробуйте позже.
th: ไม่สามารถโหลดรายการทำธุรกรรมของคุณได้ตอนนี้, กรุณาตรวจสอบการเชื่อมต่ออินเทอร์เน็ทและลองใหม่.
vi: Không thể tải danh sách giao dịch Vui lòng kiểm tra kết nối mạng rồi thử lại.
zh_hans: 无法加载交易列表 请检查您的网络连接，并稍后再试。

# WalletContactsListLoadError
source: Could not load your contacts list now Please check your internet connection and try a later.
ar: خطأ تحميل قائمة جهات الاتصال الخاصة بك، يرجى التحقق من الاتصال بالانترنت ومحاولة مرة أخرى
hi: अब आपके संपर्कों की सूची नहीं लोड की जा सकती है। कृपया अपना इंटरनेट कनेक्शन जांचें और बाद में प्रयास करें।
id: Tidak dapat memuat daftar kontak Anda sekarang nHarap periksa koneksi internet Anda dan coba lagi.
ko: 지금 연락처 목록을로드 할 수 없습니다. 인터넷 연결을 확인하고 나중에 시도하십시오.
ru: Не удалось загрузить Ваш список контактов. Пожалуйста, проверьте подключение к Интернету и попробуйте позже.
th: ไม่สามารถโหลดรายชื่อผู้ติดต่อได้ตอนนี้, กรุณาตรวจสอบการเชื่อมต่ออินเทอร์เน็ทและลองใหม่.
vi: Không thể tải danh bạ Vui lòng kiểm tra kết nối mạng rồi thử lại.
zh_hans: 无法加载联系人列表 请检查您的网络连接，并稍后再试。

# Set PIN
source: Reset PIN
ar: إعادة ضبط الرمز السري
hi: PIN रीसेट करें
ko: PIN 재설정
ru: Сбросить PIN
th: ติดตั้ง PIN อีกครั้ง
vi: Đặt lại PIN
zh_hans: 重置PIN

source: Change PIN
ar: تغيير الرمز السري
hi: PIN बदलें
id: Ganti PIN
ko: PIN 변경
ru: Смена PIN
th: เปลี่ยน PIN
vi: Đổi PIN
zh_hans: 修改PIN

source: Enter your account password to change PIN code
ar: أدخل كلمة مرور حسابك لتغيير الرمز السري
hi: PIN कोड बदलने के लिए अपने खाते का पासवर्ड दर्ज करें
id: Masukkan password akun Anda untuk mengubah kode PIN
ko: PIN 코드를 변경하려면 계정 비밀번호를 입력하십시오
ru: Введите пароль своего аккаунта для сброса PIN
th: ใส่รหัสผ่านบัญชีเพื่อทำการเปลี่ยนรหัส PIN
vi: Nhập mật khẩu tài khoản của bạn để đổi PIN
zh_hans: 输入账户密码以更改PIN码

source: Password too short
ar: كلمة مرور قصيرة جداً
hi: पासवर्ड बहुत छोटा है
id: Password terlalu pendek
ko: 비밀번호가 너무 짧습니다
ru: Пароль слишком короткий
th: รหัสสั้นไป
vi: Mật khẩu quá ngắn
zh_hans: 密码过短

source: Verification failed
ar: فشل التوثيق
hi: सत्यापन असफल हो गया
id: Verifikasi gagal
ko: 인증 실패
ru: Ошибка верификации
th: การยืนยันล้มเหลว
vi: Xác minh thất bại
zh_hans: 验证错误

source: PIN code successfuly changed
ar: تم تغيير الرمز السري بنجاح
hi: PIN कोड सफलतापूर्वक बदला गया
id: Kode PIN berhasil diganti
ko: PIN 코드가 성공적으로 변경되었습니다
ru: PIN успешно изменен
th: การเปลี่ยนรหัส PIN สำเร็จ
vi: Đã đổi mã PIN thành công
zh_hans: 已成功修改PIN码

source: PIN code saved
ar: تم حفظ الرمز السري بنجاح
hi: PIN कोड सहेजा गया
id: Kode PIN disimpan
ko: PIN 코드 저장 됨
ru: PIN код сохранен
th: บันทึกรหัส PIN
vi: Đã lưu mã PIN
zh_hans: 已保存PIN码

source: Password
ar: كلمة المرور
hi: पासवर्ड
ko: 암호
ru: Пароль
th: รหัส
vi: Mật khẩu
zh_hans: 密码

# WalletScanQRforNotFriendMessage
source: You need to add this user as a friend before sending ECHT
ru: Нужно добавить этого пользователя в друзья перед отправкой ECHT
